src/cf/Documents/ПодтверждениеНулевойСтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПодтверждениеНулевойСтавкиНДС</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.НДСЗаписиКнигиПродаж</xr:Item>
				<xr:Item>AccumulationRegister.НДСРеализация0</xr:Item>
				<xr:Item>AccumulationRegister.НДСПредъявленныйРеализация0</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяПрочихРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидЦенности</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыЦенностей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Покупатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументОтгрузки</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РасходнаяНакладная</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтчетКомиссионера</v8:Type>
								<v8:Type>cfg:DocumentRef.ДокументРасчетовСКонтрагентом</v8:Type>
								<v8:Type>cfg:DocumentRef.АктВыполненныхРабот</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтчетОПереработке</v8:Type>
								<v8:Type>cfg:DocumentRef.СчетФактура</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтчетКомитенту</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Событие</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СобытияПоНДСПродажи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПродажиСНДС0</Name>
							<Comment>Сумма продаж, по которым применяется ставка НДС 0%</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КурсоваяРазница</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетФактураВыданный</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СчетФактура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодыОперацийПредставление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтредактированыСтрокиКодовОпераций</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КодыОперацийНалоговаяБаза</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодОперации</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>7</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НесырьевыеТовары</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПродажиСНДС0</Name>
							<Comment>Сумма продаж, по которым применяется ставка НДС 0%</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/InformationRegisters/ДанныеПервичныхДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДанныеПервичныхДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРегистратора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерРегистратора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоУниверсальныйДокумент</Name>
					<Comment>УПД, УКД</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоКорректировочныйДокумент</Name>
					<Comment>УКД</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ФормированиеЗаписейКнигиПокупок</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРеализации</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходнаяНакладная</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионера</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходнаяНакладная</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураПолученный</v8:Type>
						<v8:Type>cfg:DocumentRef.ДокументРасчетовСКонтрагентом</v8:Type>
						<v8:Type>cfg:DocumentRef.АктВыполненныхРабот</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходСоСчета</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОПереработке</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактура</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеВКассу</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаПоступления</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриемИПередачаВРемонт</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ПодтверждениеНулевойСтавкиНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявлениеОВвозеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетПереработчика</v8:Type>
						<v8:Type>cfg:DocumentRef.ФормированиеЗаписейРаздела7ДекларацииНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.ПодтверждениеОплатыНДСВБюджет</v8:Type>
						<v8:Type>cfg:DocumentRef.ФормированиеЗаписейКнигиПродаж</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитенту</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходИзКассы</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтражениеНДСКВычету</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходыПриИмпорте</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНаСчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ДополнительныеРасходы</v8:Type>
						<v8:Type>cfg:DocumentRef.ОперацияПоПлатежнымКартам</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаТоваровМеждуОрганизациями</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/AccumulationRegisters/НДСРеализация0.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>НДСРеализация0</Name>
			<Comment>НДС по реализации 0%</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаБезНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КурсоваяРазница</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СобытияПоНДСПродажи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НДССостоянияРеализация0</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетФактура</Name>
					<Comment>Счет-фактура (документ реализации)</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ПередачаВА</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходнаяНакладная</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионера</v8:Type>
						<v8:Type>cfg:DocumentRef.ДокументРасчетовСКонтрагентом</v8:Type>
						<v8:Type>cfg:DocumentRef.АктВыполненныхРабот</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактура</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриемИПередачаВРемонт</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ПодтверждениеНулевойСтавкиНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявлениеОВвозеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитенту</v8:Type>
						<v8:Type>cfg:DocumentRef.Взаимозачет</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦенности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЦенностей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Покупатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/Enums/НДССостоянияРеализация0.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>НДССостоянияРеализация0</Name>
			<Comment>НДС состояния по реализации со ставкой НДС 0%</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОжидаетсяПодтверждение</Name>
					<Comment>Ожидается подтверждение 0%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодтвержденаРеализация0</Name>
					<Comment>Подтверждена реализация 0%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПодтвержденаРеализация0</Name>
					<Comment>Не подтверждена реализация 0%</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Запас</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Работа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Операция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидРабот</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодарочныйСертификат</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/ПодтверждениеНулевойСтавкиНДС/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ВремяДокументаПоУмолчанию() Экспорт
	
	Возврат Новый Структура("Часы, Минуты", 22, 0);
	
КонецФункции

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"ПрисоединитьДополнительныеТаблицы
	|ЭтотСписок КАК ЭтотСписок
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК ОбособленныеПодразделения 
	|	ПО ОбособленныеПодразделения.ГоловнаяОрганизация = ЭтотСписок.Организация
	|;
	|РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(ОбособленныеПодразделения.Ссылка)
	|";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
// ПОДГОТОВКА ПАРАМЕТРОВ ПРОВЕДЕНИЯ ДОКУМЕНТА

Функция ПодготовитьПараметрыПроведения(ДокументСсылка, КлассифицироватьНоменклатуруПоОперациям0, Отказ) Экспорт
	
	ПараметрыПроведения = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("КлассифицироватьНоменклатуруПоОперациям0", КлассифицироватьНоменклатуруПоОперациям0);
	Запрос.Текст = ТекстЗапросаРеквизитыДокумента();
	Результат = Запрос.Выполнить();

	Реквизиты = ПолучитьСтруктуруИзРезультатаЗапроса(Результат);
 
	Если НЕ УчетнаяПолитика.Существует(Реквизиты.Организация, Реквизиты.Период) Тогда
		Отказ = Истина;
		Возврат ПараметрыПроведения;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Период", Реквизиты.Период);
	Запрос.УстановитьПараметр("Организация", Реквизиты.Организация);
	
	ПараметрыПроведения.Вставить("ТаблицаРеквизиты", Результат.Выгрузить());
	
	НомераТаблиц = Новый Структура;
	
	Запрос.Текст = ТекстЗапросаТаблицыДокумента(НомераТаблиц)
		+ ТекстЗапросаСтавкаПодтверждена(НомераТаблиц, Реквизиты.КлассифицироватьНоменклатуруПоОперациям0)
		+ ТекстЗапросаСтавкаНеПодтверждена(НомераТаблиц, Реквизиты.КлассифицироватьНоменклатуруПоОперациям0);
		
	Результат = Запрос.ВыполнитьПакет();
	
	Для каждого НомерТаблицы Из НомераТаблиц Цикл
		ПараметрыПроведения.Вставить(НомерТаблицы.Ключ, Результат[НомерТаблицы.Значение].Выгрузить());
	КонецЦикла;
	
	Возврат ПараметрыПроведения;
		
КонецФункции

Функция ТекстЗапросаРеквизитыДокумента()

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Реквизиты.Дата КАК Период,
	|	Реквизиты.Организация,
	|	Реквизиты.Ссылка КАК Регистратор,
	|	Реквизиты.СтатьяПрочихРасходов КАК СтатьяПрочихРасходов,
	|	&КлассифицироватьНоменклатуруПоОперациям0 КАК КлассифицироватьНоменклатуруПоОперациям0
	|ИЗ
	|	Документ.ПодтверждениеНулевойСтавкиНДС КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицыДокумента(НомераТаблиц)

	НомераТаблиц.Вставить("ВременнаяТаблицаСостав", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Состав.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА Состав.ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.Товары)
	|		ИНАЧЕ Состав.ВидЦенности
	|	КОНЕЦ КАК ВидЦенности,
	|	Состав.Покупатель КАК Покупатель,
	|	Состав.ДокументОтгрузки КАК СчетФактура,
	|	ЕСТЬNULL(ДанныеПервичныхДокументов.Дата, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаРеализации,
	|	Состав.Событие КАК Событие,
	|	Состав.Ссылка.Дата КАК ДатаСобытия,
	|	Состав.ПродажиСНДС0 КАК СуммаБезНДС,
	|	Состав.СтавкаНДС КАК СтавкаНДС,
	|	Состав.СуммаНДС КАК НДС,
	|	Состав.КурсоваяРазница КАК КурсоваяРазница,
	|	Состав.СчетФактураВыданный КАК СчетФактураВыданный,
	|	Состав.Ссылка КАК Ссылка,
	|	Состав.КлючСтроки КАК КлючСтроки,
	|	Состав.ДокументОтгрузки КАК ДокументОтгрузки
	|ПОМЕСТИТЬ ВременнаяТаблицаСостав
	|ИЗ
	|	Документ.ПодтверждениеНулевойСтавкиНДС.Состав КАК Состав
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПервичныхДокументов КАК ДанныеПервичныхДокументов
	|		ПО Состав.ДокументОтгрузки = ДанныеПервичныхДокументов.Документ
	|ГДЕ
	|	Состав.Ссылка = &Ссылка";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияУНФКлиентСервер.ТекстРазделителяЗапросовПакета();
	
КонецФункции

Функция ТекстЗапросаСтавкаПодтверждена(НомераТаблиц,КлассифицироватьНоменклатуруПоОперациям0)
	
	НомераТаблиц.Вставить("ТаблицаСтавкаПодтвержденаРеализация0",	НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ТаблицаСтавкаПодтверждена",				НомераТаблиц.Количество());
	
	Если КлассифицироватьНоменклатуруПоОперациям0 Тогда
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Перечисление.НДССостоянияРеализация0.ОжидаетсяПодтверждение) КАК Состояние,
		|	Состав.СчетФактура КАК СчетФактура,
		|	Состав.ВидЦенности КАК ВидЦенности,
		|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0) КАК СтавкаНДС,
		|	Состав.Покупатель КАК Покупатель,
		|	Состав.СуммаБезНДС КАК СуммаБезНДС,
		|	0 КАК НДС,
		|	Состав.КурсоваяРазница КАК КурсоваяРазница,
		|	Состав.ДатаСобытия КАК ДатаСобытия,
		|	Состав.Событие КАК Событие
		|ИЗ
		|	ВременнаяТаблицаСостав КАК Состав
		|ГДЕ
		|	Состав.Событие = ЗНАЧЕНИЕ(Перечисление.СобытияПоНДСПродажи.ПодтвержденаСтавка0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Состав.НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Состав.СчетФактура КАК СчетФактура,
		|	ЕСТЬNULL(РеквизитыДокументовРасчетов.ДатаРегистратора, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаРеализации,
		|	Состав.ВидЦенности КАК ВидЦенности,
		|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0) КАК СтавкаНДС,
		|	Состав.Покупатель КАК Покупатель,
		|	ЗНАЧЕНИЕ(Перечисление.НДССостоянияРеализация0.ПодтвержденаРеализация0) КАК Состояние,
		|	ЗНАЧЕНИЕ(Перечисление.НДСВидНачисления.Реализация0) КАК ВидНачисления,
		|	Состав.КурсоваяРазница КАК КурсоваяРазница,
		|	Состав.ДатаСобытия КАК ДатаСобытия,
		|	Состав.Событие КАК Событие,
		|	""Подтвержден НДС 0% по реализации"" КАК Содержание,
		|	ЕСТЬNULL(ПодтверждениеНулевойСтавкиНДСКодыОперацийНалоговаяБаза.НесырьевыеТовары, ЛОЖЬ) КАК НесырьевыеТовары,
		|	ЕСТЬNULL(ПодтверждениеНулевойСтавкиНДСКодыОперацийНалоговаяБаза.ПродажиСНДС0, Состав.СуммаБезНДС) КАК СуммаБезНДС,
		|	0 КАК НДС,
		|	ПодтверждениеНулевойСтавкиНДСКодыОперацийНалоговаяБаза.КодОперации КАК КодОперации0,
		|	Состав.НомерСтроки
		|ИЗ
		|	ВременнаяТаблицаСостав КАК Состав
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПервичныхДокументов КАК РеквизитыДокументовРасчетов
		|		ПО (РеквизитыДокументовРасчетов.Организация = &Организация)
		|			И Состав.СчетФактура = РеквизитыДокументовРасчетов.Документ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПодтверждениеНулевойСтавкиНДС.КодыОперацийНалоговаяБаза КАК ПодтверждениеНулевойСтавкиНДСКодыОперацийНалоговаяБаза
		|		ПО Состав.КлючСтроки = ПодтверждениеНулевойСтавкиНДСКодыОперацийНалоговаяБаза.КлючСтроки
		|ГДЕ
		|	Состав.Событие = ЗНАЧЕНИЕ(Перечисление.СобытияПоНДСПродажи.ПодтвержденаСтавка0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Состав.НомерСтроки";
		
	Иначе
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Перечисление.НДССостоянияРеализация0.ОжидаетсяПодтверждение) КАК Состояние,
		|	Состав.СчетФактура,
		|	Состав.ВидЦенности,
		|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0) КАК СтавкаНДС,
		|	Состав.Покупатель,
		|	Состав.СуммаБезНДС КАК СуммаБезНДС,
		|	0 КАК НДС,
		|	Состав.КурсоваяРазница,
		|	Состав.ДатаСобытия,
		|	Состав.Событие
		|ИЗ
		|	ВременнаяТаблицаСостав КАК Состав
		|ГДЕ
		|	Состав.Событие = ЗНАЧЕНИЕ(Перечисление.СобытияПоНДСПродажи.ПодтвержденаСтавка0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Состав.НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Состав.СчетФактура,
		|	ЕСТЬNULL(РеквизитыДокументовРасчетов.ДатаРегистратора, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаРеализации,
		|	Состав.ВидЦенности,
		|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0) КАК СтавкаНДС,
		|	Состав.Покупатель,
		|	ЗНАЧЕНИЕ(Перечисление.НДССостоянияРеализация0.ПодтвержденаРеализация0) КАК Состояние,
		|	ЗНАЧЕНИЕ(Перечисление.НДСВидНачисления.Реализация0) КАК ВидНачисления,
		|	Состав.СуммаБезНДС КАК СуммаБезНДС,
		|	Состав.КурсоваяРазница КАК КурсоваяРазница,
		|	0 КАК НДС,
		|	Состав.ДатаСобытия,
		|	Состав.Событие,
		|	""Подтвержден НДС 0% по реализации"" КАК Содержание
		|ИЗ
		|	ВременнаяТаблицаСостав КАК Состав
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПервичныхДокументов КАК РеквизитыДокументовРасчетов
		|		ПО (РеквизитыДокументовРасчетов.Организация = &Организация)
		|			И Состав.СчетФактура = РеквизитыДокументовРасчетов.Документ
		|ГДЕ
		|	Состав.Событие = ЗНАЧЕНИЕ(Перечисление.СобытияПоНДСПродажи.ПодтвержденаСтавка0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Состав.НомерСтроки";

	КонецЕсли;
	
	Возврат ТекстЗапроса + ОбщегоНазначенияУНФКлиентСервер.ТекстРазделителяЗапросовПакета();
	
КонецФункции

Функция ТекстЗапросаСтавкаНеПодтверждена(НомераТаблиц,КлассифицироватьНоменклатуруПоОперациям0)
	
	НомераТаблиц.Вставить("ТаблицаСтавкаНеПодтвержденаРеализация0",	НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ТаблицаСтавкаНеПодтверждена",			НомераТаблиц.Количество());
	
	Если КлассифицироватьНоменклатуруПоОперациям0 Тогда
	
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Перечисление.НДССостоянияРеализация0.ОжидаетсяПодтверждение) КАК Состояние,
		|	Состав.СчетФактура КАК СчетФактура,
		|	Состав.ВидЦенности КАК ВидЦенности,
		|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0) КАК СтавкаНДС,
		|	Состав.Покупатель КАК Покупатель,
		|	Состав.СуммаБезНДС КАК СуммаБезНДС,
		|	0 КАК НДС,
		|	Состав.КурсоваяРазница КАК КурсоваяРазница,
		|	Состав.ДатаСобытия КАК ДатаСобытия,
		|	Состав.Событие КАК Событие
		|ИЗ
		|	ВременнаяТаблицаСостав КАК Состав
		|ГДЕ
		|	Состав.Событие = ЗНАЧЕНИЕ(Перечисление.СобытияПоНДСПродажи.НеПодтвержденаСтавка0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Состав.НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗНАЧЕНИЕ(Перечисление.НДССостоянияРеализация0.НеПодтвержденаРеализация0) КАК Состояние,
		|	Состав.СчетФактура КАК СчетФактура,
		|	Состав.ВидЦенности КАК ВидЦенности,
		|	Состав.СтавкаНДС КАК СтавкаНДС,
		|	Состав.Покупатель КАК Покупатель,
		|	ЗНАЧЕНИЕ(Перечисление.НДСВидНачисления.Реализация0) КАК ВидНачисления,
		|	Состав.ДатаСобытия КАК ДатаСобытия,
		|	Состав.Событие КАК Событие,
		|	""Не подтвержден НДС 0% по реализации"" КАК Содержание,
		|	ВЫБОР
		|		КОГДА &Период >= ДАТАВРЕМЯ(2024, 1, 1)
		|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
		|		КОГДА КОНЕЦПЕРИОДА(Состав.ДатаРеализации, КВАРТАЛ) <> КОНЕЦПЕРИОДА(&Период, КВАРТАЛ)
		|			ТОГДА НАЧАЛОПЕРИОДА(Состав.ДатаРеализации, КВАРТАЛ)
		|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
		|	КОНЕЦ КАК КорректируемыйПериод,
		|	ВЫБОР
		|		КОГДА &Период >= ДАТАВРЕМЯ(2024, 1, 1)
		|			ТОГДА ЛОЖЬ
		|		КОГДА КОНЕЦПЕРИОДА(Состав.ДатаРеализации, КВАРТАЛ) <> КОНЕЦПЕРИОДА(&Период, КВАРТАЛ)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЗаписьДополнительногоЛиста,
		|	Состав.СчетФактураВыданный КАК СчетФактураВыданный,
		|	ЕСТЬNULL(ПодтверждениеНулевойСтавкиНДСКодыОперацийНалоговаяБаза.НесырьевыеТовары, ЛОЖЬ) КАК НесырьевыеТовары,
		|	ЕСТЬNULL(ПодтверждениеНулевойСтавкиНДСКодыОперацийНалоговаяБаза.ПродажиСНДС0, Состав.СуммаБезНДС) КАК СуммаБезНДС,
		|	ЕСТЬNULL(ПодтверждениеНулевойСтавкиНДСКодыОперацийНалоговаяБаза.СуммаНДС, Состав.НДС) КАК НДС,
		|	ПодтверждениеНулевойСтавкиНДСКодыОперацийНалоговаяБаза.КодОперации КАК КодОперации0,
		|	Состав.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	ВременнаяТаблицаСостав КАК Состав
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПодтверждениеНулевойСтавкиНДС.КодыОперацийНалоговаяБаза КАК ПодтверждениеНулевойСтавкиНДСКодыОперацийНалоговаяБаза
		|		ПО Состав.КлючСтроки = ПодтверждениеНулевойСтавкиНДСКодыОперацийНалоговаяБаза.КлючСтроки
		|ГДЕ
		|	Состав.Событие = ЗНАЧЕНИЕ(Перечисление.СобытияПоНДСПродажи.НеПодтвержденаСтавка0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Состав.НомерСтроки";
	
	Иначе
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Перечисление.НДССостоянияРеализация0.ОжидаетсяПодтверждение) КАК Состояние,
		|	Состав.СчетФактура КАК СчетФактура,
		|	Состав.ВидЦенности КАК ВидЦенности,
		|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0) КАК СтавкаНДС,
		|	Состав.Покупатель КАК Покупатель,
		|	Состав.СуммаБезНДС КАК СуммаБезНДС,
		|	0 КАК НДС,
		|	Состав.КурсоваяРазница КАК КурсоваяРазница,
		|	Состав.ДатаСобытия КАК ДатаСобытия,
		|	Состав.Событие КАК Событие
		|ИЗ
		|	ВременнаяТаблицаСостав КАК Состав
		|ГДЕ
		|	Состав.Событие = ЗНАЧЕНИЕ(Перечисление.СобытияПоНДСПродажи.НеПодтвержденаСтавка0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Состав.НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Перечисление.НДССостоянияРеализация0.НеПодтвержденаРеализация0) КАК Состояние,
		|	Состав.СчетФактура КАК СчетФактура,
		|	Состав.ВидЦенности КАК ВидЦенности,
		|	Состав.СтавкаНДС КАК СтавкаНДС,
		|	Состав.Покупатель КАК Покупатель,
		|	ЗНАЧЕНИЕ(Перечисление.НДСВидНачисления.Реализация0) КАК ВидНачисления,
		|	Состав.СуммаБезНДС КАК СуммаБезНДС,
		|	Состав.НДС КАК НДС,
		|	Состав.ДатаСобытия КАК ДатаСобытия,
		|	Состав.Событие КАК Событие,
		|	""Не подтвержден НДС 0% по реализации"" КАК Содержание,
		|	ВЫБОР
		|		КОГДА &Период >= ДАТАВРЕМЯ(2024, 1, 1)
		|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
		|		КОГДА КОНЕЦПЕРИОДА(Состав.ДатаРеализации, КВАРТАЛ) <> КОНЕЦПЕРИОДА(&Период, КВАРТАЛ)
		|			ТОГДА НАЧАЛОПЕРИОДА(Состав.ДатаРеализации, КВАРТАЛ)
		|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
		|	КОНЕЦ КАК КорректируемыйПериод,
		|	ВЫБОР
		|		КОГДА &Период >= ДАТАВРЕМЯ(2024, 1, 1)
		|			ТОГДА ЛОЖЬ
		|		КОГДА КОНЕЦПЕРИОДА(Состав.ДатаРеализации, КВАРТАЛ) <> КОНЕЦПЕРИОДА(&Период, КВАРТАЛ)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЗаписьДополнительногоЛиста,
		|	Состав.СчетФактураВыданный КАК СчетФактураВыданный
		|ИЗ
		|	ВременнаяТаблицаСостав КАК Состав
		|ГДЕ
		|	Состав.Событие = ЗНАЧЕНИЕ(Перечисление.СобытияПоНДСПродажи.НеПодтвержденаСтавка0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Состав.НомерСтроки";

	КонецЕсли;
	
	Возврат ТекстЗапроса + ОбщегоНазначенияУНФКлиентСервер.ТекстРазделителяЗапросовПакета();

КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	Возврат;

	// Счета-фактуры
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "СчетФактура";
	КомандаПечати.Представление = НСтр("ru = 'Счета-фактуры'");
	КомандаПечати.Обработчик    = "УчетНДСКлиент.ВыполнитьКомандуПечатиСчетовФактур";

КонецПроцедуры

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СчетФактура") Тогда
		МассивСчетовФактур = ПолучитьМассивСчетовФактурОбъктов(МассивОбъектов);
		Документы.СчетФактура.Печать(МассивСчетовФактур, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьМассивСчетовФактурОбъктов(МассивОбъектов)
	
	Запрос = Новый Запрос();
	Запрос.Параметры.Вставить("МассивОбъектов", МассивОбъектов);
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ПодтверждениеНулевойСтавкиСостав.СчетФактураВыданный
	|ИЗ
	|	Документ.ПодтверждениеНулевойСтавкиНДС.Состав КАК ПодтверждениеНулевойСтавкиСостав
	|ГДЕ
	|	ПодтверждениеНулевойСтавкиСостав.Ссылка В (&МассивОбъектов)
	|	И ПодтверждениеНулевойСтавкиСостав.СчетФактураВыданный <> ЗНАЧЕНИЕ(Документ.СчетФактураВыданный.ПустаяСсылка)";
	
	Запрос.Текст = ТекстЗапроса;
	
	Возврат (Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("СчетФактура"));
	
КонецФункции

///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Производит заполнение документа
//
// Параметры:
//   СтруктураПараметров - Струкутра - структура входных параметров с ключами:
//     * Организация           - СправочникСсылка.Организация - организация, для которой будут получены данные для заполнения документа.
//     * Дата                  - Дата - дата, на которую будут получены данные для заполнения документа.
//     * КлассифицироватьНоменклатуруПоОперациям0 - Булево значение ресурса КлассифицироватьНоменклатуруПоОперациям0 регистра НастройкиУчетаНДС.
//     * ТаблицаКодовОпераций0 - ТаблицаЗначений - содержит значания общего макета ПереченьКодовОпераций0.
//   АдресХранилища - Строка - адрес временного хранилища для помещения результата выполнения.
Процедура ЗаполнитьДокумент(СтруктураПараметров, АдресХранилища) Экспорт
	
	Дата = СтруктураПараметров.Дата;
	Организация = СтруктураПараметров.Организация;
	КлассифицироватьНоменклатуруПоОперациям0 = СтруктураПараметров.КлассифицироватьНоменклатуруПоОперациям0;
	
	Состав = Новый ТаблицаЗначений();
	Для Каждого КолонкаТабличнойЧасти Из Метаданные.Документы.ПодтверждениеНулевойСтавкиНДС.ТабличныеЧасти.Состав.Реквизиты Цикл
		Состав.Колонки.Добавить(КолонкаТабличнойЧасти.Имя, КолонкаТабличнойЧасти.Тип);
	КонецЦикла;
	
	ДанныеДляЗаполнения = Новый Структура;
	
	Если КлассифицироватьНоменклатуруПоОперациям0
		И УчетНДСПереопределяемый.ВерсияПостановленияНДС1137(Дата) >= 3 Тогда
		
		КодыОперацийНалоговаяБаза = Новый ТаблицаЗначений();
		Для Каждого КолонкаТабличнойЧасти Из Метаданные.Документы.ПодтверждениеНулевойСтавкиНДС.ТабличныеЧасти.КодыОперацийНалоговаяБаза.Реквизиты Цикл
			КодыОперацийНалоговаяБаза.Колонки.Добавить(КолонкаТабличнойЧасти.Имя, КолонкаТабличнойЧасти.Тип);
		КонецЦикла;
		
		ТаблицаКодовОпераций0 = СтруктураПараметров.ТаблицаКодовОпераций0;
		
		ДатаЗапроса = Дата;
		
		Если НЕ ЗначениеЗаполнено(ДатаЗапроса) Тогда
			
			ДатаЗапроса = КонецДня(ТекущаяДатаСеанса());
			
		КонецЕсли;
		
		ВалютаРеглУчета = Константы.ВалютаУчета.Получить();
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("КонецПериода",            Новый Граница(КонецДня(ДатаЗапроса), ВидГраницы.Включая));
		Запрос.УстановитьПараметр("Организация",             Организация);
		Запрос.УстановитьПараметр("СостояниеПредположения0", Перечисления.НДССостоянияРеализация0.ОжидаетсяПодтверждение);
		Запрос.Параметры.Вставить("ДатаЗапроса",             ДатаЗапроса);
		Запрос.Параметры.Вставить("Офшоры",                  УчетОфшоров.СписокОфшоров(ДатаЗапроса));
		Запрос.Параметры.Вставить("ВалютаРеглУчета",         ВалютаРеглУчета);
		Запрос.Параметры.Вставить("ТаблицаКодовОпераций0",   ТаблицаКодовОпераций0);
		Запрос.Параметры.Вставить("КодОперацииПоУмолчанию",  ""); // Значение в случае неопределения конкретной операции НДС 0%
		Запрос.Параметры.Вставить("РФ",                      Справочники.СтраныМира.Россия);
		Запрос.Параметры.Вставить("ПлательщикНДСНаУСНБезВычетов", Не УчетнаяПолитика.ПлательщикНДСНаУСНСВычетами(Организация, ДатаЗапроса));
		
		Если ЗначениеЗаполнено(Организация) Тогда
			
			Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Организация, "ОбособленноеПодразделение, ГоловнаяОрганизация");
			
			Если Реквизиты.ОбособленноеПодразделение Тогда
				Запрос.УстановитьПараметр("ГоловнаяОрганизация", Реквизиты.ГоловнаяОрганизация);
			Иначе
				Запрос.УстановитьПараметр("ГоловнаяОрганизация", Организация);
			КонецЕсли;
			
		Иначе
			Запрос.УстановитьПараметр("ГоловнаяОрганизация", Организация);
		КонецЕсли;
		
		Запрос.Текст = ТекстЗапросаРасчетКодовОпераций0();
		
		Событие = Перечисления.СобытияПоНДСПродажи.ПодтвержденаСтавка0;
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			Ном = 0;
			ВыборкаЗакончилась = Ложь;
			
			Пока Ном < Выборка.Количество() И НЕ ВыборкаЗакончилась Цикл
				
				СтрокаСостава = Состав.Добавить();
				КлючСтроки = Новый УникальныйИдентификатор;
				
				СтрокаСостава.ДокументОтгрузки = Выборка.ДокументОтгрузки;
				СтрокаСостава.Покупатель = Выборка.Покупатель;
				СтрокаСостава.Событие = Событие;
				СтрокаСостава.ПродажиСНДС0 = Выборка.НалоговаяБазаДокументаОтгрузки;
				СтрокаСостава.КлючСтроки = КлючСтроки;
				
				КолвоКодовДокументаОтгрузки = 0;
				
				Пока СтрокаСостава.ДокументОтгрузки = Выборка.ДокументОтгрузки
					И СтрокаСостава.Покупатель = Выборка.Покупатель Цикл
					
					СтрокаКодыОпераций = КодыОперацийНалоговаяБаза.Добавить();
					СтрокаКодыОпераций.КлючСтроки = КлючСтроки;
					СтрокаКодыОпераций.КодОперации = Выборка.Код;
					СтрокаКодыОпераций.НесырьевыеТовары = Выборка.НесырьевыеТовары;
					СтрокаКодыОпераций.ПродажиСНДС0 = Выборка.НалоговаяБазаКодаОперации;
					
					Если ЗначениеЗаполнено(Выборка.Код) Тогда
						КодОперации = Выборка.Код;
					Иначе
						КодОперации = "<...>";
					КонецЕсли;
					
					Если КолвоКодовДокументаОтгрузки < 2 Тогда
						
						СтрокаСостава.КодыОперацийПредставление = СтрокаСостава.КодыОперацийПредставление +
									?(ЗначениеЗаполнено(СтрокаСостава.КодыОперацийПредставление), ";", "") + КодОперации;
						
					КонецЕсли;
					
					Ном = Ном + 1;
					КолвоКодовДокументаОтгрузки = КолвоКодовДокументаОтгрузки + 1;
					
					Если Не Выборка.Следующий() Тогда
						
						ВыборкаЗакончилась = Истина;
						Прервать;
						
					КонецЕсли;
					
				КонецЦикла;
				
				Если КолвоКодовДокументаОтгрузки > 2 Тогда
					
					Если ЗначениеЗаполнено(СтрокаСостава.КодыОперацийПредставление) Тогда
					
						СтрокаСостава.КодыОперацийПредставление = СтрокаСостава.КодыОперацийПредставление +
										СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
												НСтр("ru = ' и ещё %1'"),
												КолвоКодовДокументаОтгрузки - 2);
						
					Иначе
												
					КонецЕсли;
				КонецЕсли;
				
			КонецЦикла;
		
		КонецЕсли;
		
		ДанныеДляЗаполнения.Вставить("КодыОперацийНалоговаяБаза",КодыОперацийНалоговаяБаза);
		
	Иначе
		
		// Старый алгоритм, в котором 1 реализации соответствует 1 код операции НДС 0%
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("КонецПериода",            Новый Граница(КонецДня(Дата), ВидГраницы.Включая));
		Запрос.УстановитьПараметр("Организация",             Организация);
		Запрос.УстановитьПараметр("СостояниеПредположения0", Перечисления.НДССостоянияРеализация0.ОжидаетсяПодтверждение);
		
		ТекстПостановление1137 = 
		"ВЫБРАТЬ
		|	НДСРеализация0Остатки.СчетФактура КАК ДокументОтгрузки,
		|	НДСРеализация0Остатки.ВидЦенности,
		|	НДСРеализация0Остатки.СтавкаНДС,
		|	НДСРеализация0Остатки.СуммаБезНДСОстаток + НДСРеализация0Остатки.НДСОстаток КАК ПродажиСНДС0,
		|	НДСРеализация0Остатки.КурсоваяРазницаОстаток КАК КурсоваяРазница,
		|	НДСРеализация0Остатки.Покупатель,
		|	ЗНАЧЕНИЕ(Перечисление.СобытияПоНДСПродажи.ПодтвержденаСтавка0) КАК Событие
		|ИЗ
		|	РегистрНакопления.НДСРеализация0.Остатки(
		|			&КонецПериода,
		|			Организация = &Организация
		|				И Состояние = &СостояниеПредположения0) КАК НДСРеализация0Остатки";

		ТекстПостановление735 = 
		"ВЫБРАТЬ
		|	НДСРеализация0Остатки.СчетФактура КАК ДокументОтгрузки,
		|	НДСРеализация0Остатки.СуммаБезНДСОстаток КАК ПродажиСНДС0,
		|	НДСРеализация0Остатки.Покупатель,
		|	ЗНАЧЕНИЕ(Перечисление.СобытияПоНДСПродажи.ПодтвержденаСтавка0) КАК Событие
		|ИЗ
		|	РегистрНакопления.НДСРеализация0.Остатки(
		|			&КонецПериода,
		|			Организация = &Организация
		|				И Состояние = &СостояниеПредположения0) КАК НДСРеализация0Остатки";
		
		Если УчетНДСПереопределяемый.ВерсияПостановленияНДС1137(Дата) >= 3 Тогда
			Запрос.Текст = ТекстПостановление735;
		Иначе
			Запрос.Текст = ТекстПостановление1137;
		КонецЕсли;
		
		РезультатЗапроса = Запрос.Выполнить();
			
		Если Не РезультатЗапроса.Пустой() Тогда
			
			Выборка = РезультатЗапроса.Выбрать();
				
			Пока Выборка.Следующий() Цикл
				
				СтрокаСостава = Состав.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаСостава, Выборка);
				
			КонецЦикла;
				
		КонецЕсли;
		
	КонецЕсли;
	
	ДанныеДляЗаполнения.Вставить("Состав",Состав);
	
	ПоместитьВоВременноеХранилище(ДанныеДляЗаполнения, АдресХранилища);

КонецПроцедуры

Функция ТекстЗапросаРасчетКодовОпераций0()
	
	Разделитеть =";
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
	ТекстЗапроса = ТекстЗапросаОбщиеДанныеКлассификацииКодовОпераций() + Разделитеть +
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаКодовОпераций0.Код КАК Код,
	|	ТаблицаКодовОпераций0.ДатаНачала КАК ДатаНачала,
	|	ТаблицаКодовОпераций0.ДатаОкончания КАК ДатаОкончания,
	|	ТаблицаКодовОпераций0.Классификация КАК Классификация,
	|	ТаблицаКодовОпераций0.СырьевыеТовары КАК СырьевыеТовары,
	|	ТаблицаКодовОпераций0.НеСырьевыеТовары КАК НеСырьевыеТовары
	|ПОМЕСТИТЬ КодыОпераций0
	|ИЗ
	|	&ТаблицаКодовОпераций0 КАК ТаблицаКодовОпераций0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Классификация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КодыОпераций0.Код КАК Код,
	|	КодыОпераций0.ДатаНачала КАК ДатаНачала,
	|	КодыОпераций0.ДатаОкончания КАК ДатаОкончания,
	|	КодыОпераций0.Классификация КАК Классификация
	|ПОМЕСТИТЬ ДействующиеКодыОпераций0
	|ИЗ
	|	КодыОпераций0 КАК КодыОпераций0
	|ГДЕ
	|	(КодыОпераций0.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	|				И КодыОпераций0.ДатаНачала <= &ДатаЗапроса
	|			ИЛИ &ДатаЗапроса МЕЖДУ КодыОпераций0.ДатаНачала И КодыОпераций0.ДатаОкончания)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Классификация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	МИНИМУМ(ДействующиеКодыОпераций0.Код) КАК Код,
	|	ДействующиеКодыОпераций0.Классификация КАК Классификация,
	|	КодыОпераций0.СырьевыеТовары КАК СырьевыеТовары,
	|	КодыОпераций0.НеСырьевыеТовары КАК НеСырьевыеТовары
	|ПОМЕСТИТЬ КодыОпераций0СгруппированныеСырьевыеНеСырьевые
	|ИЗ
	|	ДействующиеКодыОпераций0 КАК ДействующиеКодыОпераций0
	|		ЛЕВОЕ СОЕДИНЕНИЕ КодыОпераций0 КАК КодыОпераций0
	|		ПО ДействующиеКодыОпераций0.Код = КодыОпераций0.Код
	|
	|СГРУППИРОВАТЬ ПО
	|	ДействующиеКодыОпераций0.Классификация,
	|	КодыОпераций0.СырьевыеТовары,
	|	КодыОпераций0.НеСырьевыеТовары
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Классификация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РасходнаяНакладнаяЗапасы.Ссылка КАК ДокументОтгрузки,
	|	ЕСТЬNULL(КодыОпераций0СгруппированныеСырьевыеНеСырьевые.Код, """") КАК Код,
	|	РасходнаяНакладнаяЗапасы.Сумма КАК НалоговаяБазаКодаОперации,
	|	КодыОпераций0СгруппированныеСырьевыеНеСырьевые.СырьевыеТовары КАК СырьевыеТовары,
	|	КодыОпераций0СгруппированныеСырьевыеНеСырьевые.НеСырьевыеТовары КАК НеСырьевыеТовары
	|ПОМЕСТИТЬ Реализации0
	|ИЗ
	|	Документ.РасходнаяНакладная.Запасы КАК РасходнаяНакладнаяЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ КодыОпераций0СгруппированныеСырьевыеНеСырьевые КАК КодыОпераций0СгруппированныеСырьевыеНеСырьевые
	|		ПО РасходнаяНакладнаяЗапасы.Номенклатура.Операции0.Код = КодыОпераций0СгруппированныеСырьевыеНеСырьевые.Классификация
	|ГДЕ
	|	РасходнаяНакладнаяЗапасы.Ссылка.Проведен
	|	И РасходнаяНакладнаяЗапасы.СтавкаНДС.ПеречислениеСтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	|	И РасходнаяНакладнаяЗапасы.Ссылка В
	|			(ВЫБРАТЬ
	|				ОтгрузкиСКодомПоУмолчанию.ДокументОтгрузки КАК ДокументОтгрузки
	|			ИЗ
	|				ОтгрузкиСКодомПоУмолчанию КАК ОтгрузкиСКодомПоУмолчанию)
	|	И (РасходнаяНакладнаяЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
	|			ИЛИ &ПлательщикНДСНаУСНБезВычетов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	АктВыполненныхРаботРаботыИУслуги.Ссылка,
	|	ЕСТЬNULL(КодыОпераций0СгруппированныеСырьевыеНеСырьевые.Код, """"),
	|	АктВыполненныхРаботРаботыИУслуги.Сумма,
	|	КодыОпераций0СгруппированныеСырьевыеНеСырьевые.СырьевыеТовары,
	|	КодыОпераций0СгруппированныеСырьевыеНеСырьевые.НеСырьевыеТовары
	|ИЗ
	|	Документ.АктВыполненныхРабот.РаботыИУслуги КАК АктВыполненныхРаботРаботыИУслуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ КодыОпераций0СгруппированныеСырьевыеНеСырьевые КАК КодыОпераций0СгруппированныеСырьевыеНеСырьевые
	|		ПО АктВыполненныхРаботРаботыИУслуги.Номенклатура.Операции0.Код = КодыОпераций0СгруппированныеСырьевыеНеСырьевые.Классификация
	|ГДЕ
	|	АктВыполненныхРаботРаботыИУслуги.Ссылка.Проведен
	|	И АктВыполненныхРаботРаботыИУслуги.СтавкаНДС.ПеречислениеСтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	|	И АктВыполненныхРаботРаботыИУслуги.Ссылка В
	|			(ВЫБРАТЬ
	|				ОтгрузкиСКодомПоУмолчанию.ДокументОтгрузки КАК ДокументОтгрузки
	|			ИЗ
	|				ОтгрузкиСКодомПоУмолчанию КАК ОтгрузкиСКодомПоУмолчанию)
	|	И (АктВыполненныхРаботРаботыИУслуги.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
	|			ИЛИ &ПлательщикНДСНаУСНБезВычетов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОтчетКомиссионераЗапасы.Ссылка,
	|	ЕСТЬNULL(КодыОпераций0СгруппированныеСырьевыеНеСырьевые.Код, """"),
	|	ОтчетКомиссионераЗапасы.Сумма,
	|	КодыОпераций0СгруппированныеСырьевыеНеСырьевые.СырьевыеТовары,
	|	КодыОпераций0СгруппированныеСырьевыеНеСырьевые.НеСырьевыеТовары
	|ИЗ
	|	Документ.ОтчетКомиссионера.Запасы КАК ОтчетКомиссионераЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ КодыОпераций0СгруппированныеСырьевыеНеСырьевые КАК КодыОпераций0СгруппированныеСырьевыеНеСырьевые
	|		ПО ОтчетКомиссионераЗапасы.Номенклатура.Операции0.Код = КодыОпераций0СгруппированныеСырьевыеНеСырьевые.Классификация
	|ГДЕ
	|	ОтчетКомиссионераЗапасы.Ссылка.Проведен
	|	И ОтчетКомиссионераЗапасы.СтавкаНДС.ПеречислениеСтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	|	И ОтчетКомиссионераЗапасы.Ссылка В
	|			(ВЫБРАТЬ
	|				ОтгрузкиСКодомПоУмолчанию.ДокументОтгрузки КАК ДокументОтгрузки
	|			ИЗ
	|				ОтгрузкиСКодомПоУмолчанию КАК ОтгрузкиСКодомПоУмолчанию)
	|	И (ОтчетКомиссионераЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
	|			ИЛИ &ПлательщикНДСНаУСНБезВычетов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОтчетКомитентуЗапасы.Ссылка,
	|	ЕСТЬNULL(КодыОпераций0СгруппированныеСырьевыеНеСырьевые.Код, """"),
	|	ОтчетКомитентуЗапасы.Сумма,
	|	КодыОпераций0СгруппированныеСырьевыеНеСырьевые.СырьевыеТовары,
	|	КодыОпераций0СгруппированныеСырьевыеНеСырьевые.НеСырьевыеТовары
	|ИЗ
	|	Документ.ОтчетКомитенту.Запасы КАК ОтчетКомитентуЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ КодыОпераций0СгруппированныеСырьевыеНеСырьевые КАК КодыОпераций0СгруппированныеСырьевыеНеСырьевые
	|		ПО ОтчетКомитентуЗапасы.Номенклатура.Операции0.Код = КодыОпераций0СгруппированныеСырьевыеНеСырьевые.Классификация
	|ГДЕ
	|	ОтчетКомитентуЗапасы.Ссылка.Проведен
	|	И ОтчетКомитентуЗапасы.СтавкаНДС.ПеречислениеСтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	|	И ОтчетКомитентуЗапасы.Ссылка В
	|			(ВЫБРАТЬ
	|				ОтгрузкиСКодомПоУмолчанию.ДокументОтгрузки КАК ДокументОтгрузки
	|			ИЗ
	|				ОтгрузкиСКодомПоУмолчанию КАК ОтгрузкиСКодомПоУмолчанию)
	|	И (ОтчетКомитентуЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
	|			ИЛИ &ПлательщикНДСНаУСНБезВычетов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОтчетОПереработкеЗапасы.Ссылка,
	|	ЕСТЬNULL(КодыОпераций0СгруппированныеСырьевыеНеСырьевые.Код, """"),
	|	ОтчетОПереработкеЗапасы.Сумма,
	|	КодыОпераций0СгруппированныеСырьевыеНеСырьевые.СырьевыеТовары,
	|	КодыОпераций0СгруппированныеСырьевыеНеСырьевые.НеСырьевыеТовары
	|ИЗ
	|	Документ.ОтчетОПереработке.Запасы КАК ОтчетОПереработкеЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ КодыОпераций0СгруппированныеСырьевыеНеСырьевые КАК КодыОпераций0СгруппированныеСырьевыеНеСырьевые
	|		ПО ОтчетОПереработкеЗапасы.Номенклатура.Операции0.Код = КодыОпераций0СгруппированныеСырьевыеНеСырьевые.Классификация
	|ГДЕ
	|	ОтчетОПереработкеЗапасы.Ссылка.Проведен
	|	И ОтчетОПереработкеЗапасы.СтавкаНДС.ПеречислениеСтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	|	И ОтчетОПереработкеЗапасы.Ссылка В
	|			(ВЫБРАТЬ
	|				ОтгрузкиСКодомПоУмолчанию.ДокументОтгрузки КАК ДокументОтгрузки
	|			ИЗ
	|				ОтгрузкиСКодомПоУмолчанию КАК ОтгрузкиСКодомПоУмолчанию)
	|	И (ОтчетОПереработкеЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
	|			ИЛИ &ПлательщикНДСНаУСНБезВычетов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОтчетОРозничныхПродажахЗапасы.Ссылка,
	|	ЕСТЬNULL(КодыОпераций0СгруппированныеСырьевыеНеСырьевые.Код, """"),
	|	ОтчетОРозничныхПродажахЗапасы.Сумма,
	|	КодыОпераций0СгруппированныеСырьевыеНеСырьевые.СырьевыеТовары,
	|	КодыОпераций0СгруппированныеСырьевыеНеСырьевые.НеСырьевыеТовары
	|ИЗ
	|	Документ.ОтчетОРозничныхПродажах.Запасы КАК ОтчетОРозничныхПродажахЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ КодыОпераций0СгруппированныеСырьевыеНеСырьевые КАК КодыОпераций0СгруппированныеСырьевыеНеСырьевые
	|		ПО ОтчетОРозничныхПродажахЗапасы.Номенклатура.Операции0.Код = КодыОпераций0СгруппированныеСырьевыеНеСырьевые.Классификация
	|ГДЕ
	|	ОтчетОРозничныхПродажахЗапасы.Ссылка.Проведен
	|	И ОтчетОРозничныхПродажахЗапасы.СтавкаНДС.ПеречислениеСтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	|	И ОтчетОРозничныхПродажахЗапасы.Ссылка В
	|			(ВЫБРАТЬ
	|				ОтгрузкиСКодомПоУмолчанию.ДокументОтгрузки КАК ДокументОтгрузки
	|			ИЗ
	|				ОтгрузкиСКодомПоУмолчанию КАК ОтгрузкиСКодомПоУмолчанию)
	|	И (ОтчетОРозничныхПродажахЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
	|			ИЛИ &ПлательщикНДСНаУСНБезВычетов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказПокупателяЗапасы.Ссылка,
	|	ЕСТЬNULL(КодыОпераций0СгруппированныеСырьевыеНеСырьевые.Код, """"),
	|	ЗаказПокупателяЗапасы.Сумма,
	|	КодыОпераций0СгруппированныеСырьевыеНеСырьевые.СырьевыеТовары,
	|	КодыОпераций0СгруппированныеСырьевыеНеСырьевые.НеСырьевыеТовары
	|ИЗ
	|	Документ.ЗаказПокупателя.Запасы КАК ЗаказПокупателяЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ КодыОпераций0СгруппированныеСырьевыеНеСырьевые КАК КодыОпераций0СгруппированныеСырьевыеНеСырьевые
	|		ПО ЗаказПокупателяЗапасы.Номенклатура.Операции0.Код = КодыОпераций0СгруппированныеСырьевыеНеСырьевые.Классификация
	|ГДЕ
	|	ЗаказПокупателяЗапасы.Ссылка.Проведен
	|	И ЗаказПокупателяЗапасы.СтавкаНДС.ПеречислениеСтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	|	И ЗаказПокупателяЗапасы.Ссылка В
	|			(ВЫБРАТЬ
	|				ОтгрузкиСКодомПоУмолчанию.ДокументОтгрузки КАК ДокументОтгрузки
	|			ИЗ
	|				ОтгрузкиСКодомПоУмолчанию КАК ОтгрузкиСКодомПоУмолчанию)
	|	И ЗаказПокупателяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗаказПокупателя.ЗаказНаряд)
	|	И (ЗаказПокупателяЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
	|			ИЛИ &ПлательщикНДСНаУСНБезВычетов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказПокупателяРаботы.Ссылка,
	|	ЕСТЬNULL(КодыОпераций0СгруппированныеСырьевыеНеСырьевые.Код, """"),
	|	ЗаказПокупателяРаботы.Сумма,
	|	КодыОпераций0СгруппированныеСырьевыеНеСырьевые.СырьевыеТовары,
	|	КодыОпераций0СгруппированныеСырьевыеНеСырьевые.НеСырьевыеТовары
	|ИЗ
	|	Документ.ЗаказПокупателя.Работы КАК ЗаказПокупателяРаботы
	|		ЛЕВОЕ СОЕДИНЕНИЕ КодыОпераций0СгруппированныеСырьевыеНеСырьевые КАК КодыОпераций0СгруппированныеСырьевыеНеСырьевые
	|		ПО ЗаказПокупателяРаботы.Номенклатура.Операции0.Код = КодыОпераций0СгруппированныеСырьевыеНеСырьевые.Классификация
	|ГДЕ
	|	ЗаказПокупателяРаботы.Ссылка.Проведен
	|	И ЗаказПокупателяРаботы.СтавкаНДС.ПеречислениеСтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	|	И ЗаказПокупателяРаботы.Ссылка В
	|			(ВЫБРАТЬ
	|				ОтгрузкиСКодомПоУмолчанию.ДокументОтгрузки КАК ДокументОтгрузки
	|			ИЗ
	|				ОтгрузкиСКодомПоУмолчанию КАК ОтгрузкиСКодомПоУмолчанию)
	|	И ЗаказПокупателяРаботы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗаказПокупателя.ЗаказНаряд)
	|	И (ЗаказПокупателяРаботы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
	|			ИЛИ &ПлательщикНДСНаУСНБезВычетов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтгрузкиСКодомПоУмолчанию.ДокументОтгрузки КАК ДокументОтгрузки,
	|	ВЫБОР
	|		КОГДА ОтгрузкиСКодомПоУмолчанию.Код = """"
	|			ТОГДА ЕСТЬNULL(Реализации0.Код, """")
	|		ИНАЧЕ ОтгрузкиСКодомПоУмолчанию.Код
	|	КОНЕЦ КАК Код,
	|	ЕСТЬNULL(Реализации0.НеСырьевыеТовары, ОтгрузкиСКодомПоУмолчанию.НесырьевыеТовары) КАК НесырьевыеТовары,
	|	ЕСТЬNULL(Реализации0.СырьевыеТовары, ОтгрузкиСКодомПоУмолчанию.СырьевыеТовары) КАК СырьевыеТовары,
	|	Реализации0.НалоговаяБазаКодаОперации КАК НалоговаяБазаКодаОперации,
	|	ОтгрузкиСКодомПоУмолчанию.Покупатель КАК Покупатель,
	|	ОтгрузкиСКодомПоУмолчанию.НалоговаяБазаДокументаОтгрузки КАК НалоговаяБазаДокументаОтгрузки
	|ИЗ
	|	ОтгрузкиСКодомПоУмолчанию КАК ОтгрузкиСКодомПоУмолчанию
	|		ЛЕВОЕ СОЕДИНЕНИЕ Реализации0 КАК Реализации0
	|		ПО ОтгрузкиСКодомПоУмолчанию.ДокументОтгрузки = Реализации0.ДокументОтгрузки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ КодыОпераций0";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаОбщиеДанныеКлассификацииКодовОпераций()
	Возврат
	"ВЫБРАТЬ
	|	НДСРеализация0Остатки.СчетФактура КАК ДокументОтгрузки,
	|	НДСРеализация0Остатки.Покупатель КАК Покупатель,
	|	НДСРеализация0Остатки.Покупатель.СтранаРегистрации КАК СтранаРегистрации,
	|	НДСРеализация0Остатки.СуммаБезНДСОстаток КАК НалоговаяБазаДокументаОтгрузки
	|ПОМЕСТИТЬ ПараметрыДокументовОтгрузки
	|ИЗ
	|	РегистрНакопления.НДСРеализация0.Остатки(
	|			&КонецПериода,
	|			Организация = &Организация
	|				И Состояние = &СостояниеПредположения0) КАК НДСРеализация0Остатки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументОтгрузки,
	|	Покупатель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПараметрыДокументовОтгрузки.ДокументОтгрузки КАК ДокументОтгрузки,
	|	&КодОперацииПоУмолчанию КАК Код,
	|	ИСТИНА КАК НесырьевыеТовары,
	|	ИСТИНА КАК СырьевыеТовары,
	|	ПараметрыДокументовОтгрузки.НалоговаяБазаДокументаОтгрузки КАК НалоговаяБазаКодаОперации,
	|	ПараметрыДокументовОтгрузки.Покупатель КАК Покупатель,
	|	ПараметрыДокументовОтгрузки.НалоговаяБазаДокументаОтгрузки КАК НалоговаяБазаДокументаОтгрузки
	|ПОМЕСТИТЬ ОтгрузкиСКодомПоУмолчанию
	|ИЗ
	|	ПараметрыДокументовОтгрузки КАК ПараметрыДокументовОтгрузки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ПараметрыДокументовОтгрузки";
	
КонецФункции

Функция ПолучитьСтруктуруИзРезультатаЗапроса(РезультатЗапроса)

	СтруктураПараметров = Новый Структура;

	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Для каждого КолонкаРезультата Из РезультатЗапроса.Колонки Цикл
		СтруктураПараметров.Вставить(КолонкаРезультата.Имя, Выборка[КолонкаРезультата.Имя]);
	КонецЦикла;
	
	Возврат СтруктураПараметров;

КонецФункции

#Область ДлительныеОперации

// Функция возвращающая таблицу значений 
// для помощника подбора классификации оперцаций НДС 0% по номенклатуре
// данная функция вызывается как фоновое задание
//
// Параметры:
//   Параметры - Структура
//		- Поля:
//			ТаблицаКодовОпераций - ТаблицаЗначений
//									- Колонки:
//										КодОперации - Строка
//										Операции СправочникСсылка.Операции0
//										ПредставлениеОпераций - Строка
//			НачалоПериода - Дата
//			КонецПериода - Дата
//			Организация - СправочникСсылка.Организации
//			Номенклатура - СправочникСсылка.Номенклатура
//			ЭтоГруппа - Булево
//
// Возвращаемое значение:
//  - ТаблицаЗначений
//		- Колонки:
//			Номенклатура - СправочникСсылка.Номенклатура
//			ПредставлениеТекущихОпераций - Строка
//			Операции - СправочникСсылка.Операции0
//			ПредставлениеОпераций - Строка
//			Порядок - Число
//			Порядок - Число
//			КлючСтроки - Строка
//			РазныеОперации - Булево
//
Функция ПодобратьОперации0(Параметры) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Параметры.Вставить("ТаблицаКодовОпераций", Параметры.ТаблицаКодовОпераций);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаКодовОпераций.КодОперации КАК КодОперации,
		|	ТаблицаКодовОпераций.Операции КАК Операции,
		|	ТаблицаКодовОпераций.ПредставлениеОпераций КАК ПредставлениеОпераций
		|ПОМЕСТИТЬ КодыОпераций
		|ИЗ
		|	&ТаблицаКодовОпераций КАК ТаблицаКодовОпераций
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	КодОперации,
		|	Операции
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	РеализацияТоваровУслугТовары.Ссылка КАК Ссылка,
		|	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ Реализации
		|ИЗ
		|	Документ.РасходнаяНакладная.Запасы КАК РеализацияТоваровУслугТовары
		|ГДЕ
		|	НЕ РеализацияТоваровУслугТовары.Ссылка.ПометкаУдаления
		|	И РеализацияТоваровУслугТовары.СтавкаНДС = &Ставка0
		|	И &ТоварыОрганизация
		|	И &ТоварыПериод
		|	И &ТоварыНоменклатура
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	"""" КАК КодОперации,
		|	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ РеализацииСКодами
		|ИЗ
		|	Реализации КАК РеализацияТоваровУслугТовары
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	КодОперации
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	РеализацииСКодами.Номенклатура КАК Номенклатура,
		|	РеализацииСКодами.Номенклатура.Операции0 КАК ТекущиеОперации,
		|	ЕСТЬNULL(КодыОпераций.Операции, ЗНАЧЕНИЕ(Справочник.Операции0.ПустаяСсылка)) КАК Операции,
		|	КодыОпераций.ПредставлениеОпераций КАК ПредставлениеОпераций
		|ПОМЕСТИТЬ Номенклатуры
		|ИЗ
		|	РеализацииСКодами КАК РеализацииСКодами
		|		ЛЕВОЕ СОЕДИНЕНИЕ КодыОпераций КАК КодыОпераций
		|		ПО РеализацииСКодами.КодОперации = КодыОпераций.КодОперации
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Номенклатуры.Номенклатура КАК Номенклатура,
		|	ЕСТЬNULL(КодыОпераций.ПредставлениеОпераций, """") КАК ПредставлениеТекущихОпераций,
		|	Номенклатуры.Операции КАК Операции,
		|	Номенклатуры.ПредставлениеОпераций КАК ПредставлениеОпераций
		|ПОМЕСТИТЬ НоменклатурыПредставлениеОпераций
		|ИЗ
		|	Номенклатуры КАК Номенклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ КодыОпераций КАК КодыОпераций
		|		ПО Номенклатуры.ТекущиеОперации = КодыОпераций.Операции
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Номенклатуры.Номенклатура КАК Номенклатура,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Номенклатуры.Операции) КАК КолвоОпераций,
		|	0 КАК КолвоПустыхОпераций
		|ПОМЕСТИТЬ НоменклатураКолвоОперацийДляСвертки
		|ИЗ
		|	Номенклатуры КАК Номенклатуры
		|
		|СГРУППИРОВАТЬ ПО
		|	Номенклатуры.Номенклатура
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Номенклатуры.Номенклатура,
		|	0,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Номенклатуры.Операции)
		|ИЗ
		|	Номенклатуры КАК Номенклатуры
		|ГДЕ
		|	Номенклатуры.Операции = ЗНАЧЕНИЕ(Справочник.Операции0.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	Номенклатуры.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НоменклатураКолвоОперацийДляСвертки.Номенклатура КАК Номенклатура,
		|	СУММА(НоменклатураКолвоОперацийДляСвертки.КолвоОпераций) КАК КолвоОпераций,
		|	СУММА(НоменклатураКолвоОперацийДляСвертки.КолвоПустыхОпераций) КАК КолвоПустыхОпераций
		|ПОМЕСТИТЬ НоменклатураКолвоОпераций
		|ИЗ
		|	НоменклатураКолвоОперацийДляСвертки КАК НоменклатураКолвоОперацийДляСвертки
		|
		|СГРУППИРОВАТЬ ПО
		|	НоменклатураКолвоОперацийДляСвертки.Номенклатура
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Номенклатуры.Номенклатура КАК Номенклатура,
		|	Номенклатуры.ПредставлениеТекущихОпераций КАК ПредставлениеТекущихОпераций,
		|	Номенклатуры.Операции КАК Операции,
		|	Номенклатуры.ПредставлениеОпераций КАК ПредставлениеОпераций,
		|	ВЫБОР
		|		КОГДА НоменклатураКолвоОпераций.КолвоОпераций = НоменклатураКолвоОпераций.КолвоПустыхОпераций
		|			ТОГДА 2
		|		КОГДА НоменклатураКолвоОпераций.КолвоОпераций = 1
		|					И Номенклатуры.Операции <> ЗНАЧЕНИЕ(Справочник.Операции0.ПустаяСсылка)
		|				ИЛИ НоменклатураКолвоОпераций.КолвоОпераций - НоменклатураКолвоОпераций.КолвоПустыхОпераций = 1
		|			ТОГДА 1
		|		ИНАЧЕ 3
		|	КОНЕЦ КАК Порядок,
		|	ВЫБОР
		|		КОГДА НоменклатураКолвоОпераций.КолвоОпераций - НоменклатураКолвоОпераций.КолвоПустыхОпераций > 1
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК РазныеОперации
		|ИЗ
		|	НоменклатурыПредставлениеОпераций КАК Номенклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ НоменклатураКолвоОпераций КАК НоменклатураКолвоОпераций
		|		ПО Номенклатуры.Номенклатура = НоменклатураКолвоОпераций.Номенклатура
		|ГДЕ
		|	(НоменклатураКолвоОпераций.КолвоОпераций = 1
		|			ИЛИ НоменклатураКолвоОпераций.КолвоОпераций > 1
		|				И Номенклатуры.Операции <> ЗНАЧЕНИЕ(Справочник.Операции0.ПустаяСсылка))
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок УБЫВ,
		|	Номенклатура,
		|	ПредставлениеТекущихОпераций
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	Если ЗначениеЗаполнено(Параметры.Организация) Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст,
			"&ТоварыОрганизация","РеализацияТоваровУслугТовары.Ссылка.Организация = &Организация");
		
		Запрос.Параметры.Вставить("Организация", Параметры.Организация);
		
	Иначе
		
		Запрос.Параметры.Вставить("ТоварыОрганизация", Истина);
		Запрос.Параметры.Вставить("УслугиОрганизация", Истина);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.НачалоПериода)
		И ЗначениеЗаполнено(Параметры.КонецПериода) Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст,
			"&ТоварыПериод","РеализацияТоваровУслугТовары.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода");
		
		Запрос.Параметры.Вставить("НачалоПериода", Параметры.НачалоПериода);
		Запрос.Параметры.Вставить("КонецПериода", Параметры.КонецПериода);
		
	ИначеЕсли ЗначениеЗаполнено(Параметры.НачалоПериода)
		И НЕ ЗначениеЗаполнено(Параметры.КонецПериода) Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст,
			"&ТоварыПериод","РеализацияТоваровУслугТовары.Ссылка.Дата >= &НачалоПериода");
		
		Запрос.Параметры.Вставить("НачалоПериода", Параметры.НачалоПериода);
		
	ИначеЕсли НЕ ЗначениеЗаполнено(Параметры.НачалоПериода)
		И ЗначениеЗаполнено(Параметры.КонецПериода) Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст,
			"&ТоварыПериод","РеализацияТоваровУслугТовары.Ссылка.Дата <= &КонецПериода");
		
		Запрос.Параметры.Вставить("КонецПериода", Параметры.КонецПериода);
		
	Иначе
		
		Запрос.Параметры.Вставить("ТоварыПериод", Истина);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.Номенклатура) Тогда
		
		Если Параметры.ЭтоГруппа Тогда
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст,
				"&ТоварыНоменклатура","РеализацияТоваровУслугТовары.Номенклатура В ИЕРАРХИИ(&Номенклатура)");
			
		Иначе
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст,
				"&ТоварыНоменклатура","РеализацияТоваровУслугТовары.Номенклатура = &Номенклатура");
			
		КонецЕсли;
		
		Запрос.Параметры.Вставить("Номенклатура", Параметры.Номенклатура);
		
	Иначе
		
		Запрос.Параметры.Вставить("ТоварыНоменклатура", Истина);
		
	КонецЕсли;
	
	Запрос.Параметры.Вставить("Ставка0", Справочники.СтавкиНДС.СтавкаНДС(Перечисления.ВидыСтавокНДС.Нулевая));
	
	//Таблица = Запрос.Выполнить();
	
	Таблица = Запрос.Выполнить().Выгрузить();
	
	КС36 = Новый КвалификаторыСтроки(36);
	Массив = Новый Массив;
	Массив.Добавить(Тип("Строка"));
	ОписаниеТиповС36 = Новый ОписаниеТипов(Массив, , КС36);

	Таблица.Колонки.Добавить("КлючСтроки",ОписаниеТиповС36);

	Возврат Таблица;

КонецФункции

// Функция возвращающает документ отгрузки
//
// Параметры:
//  СсылкаНаДокументОснование - ДокументСсылка - Ссылка на документ основание
//  СсылкаНаСчетФактуру - ДокументСсылка - Ссылка на счет-фактуру
//
// Возвращаемое значение:
//  - Ссылка -ДокументСсылка- Ссылка на документ отгрузки
//
Функция ПолучитьДокументОтгрузкиПодтвержденияНулевойСтавки(СсылкаНаДокументОснование, СсылкаНаСчетФактуру) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СсылкаНаДокументОснование", СсылкаНаДокументОснование);
	Запрос.УстановитьПараметр("СсылкаНаСчетФактуру", СсылкаНаСчетФактуру);
	
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПодтверждениеНулевойСтавкиНДССостав.ДокументОтгрузки КАК ДокументОтгрузки
	|ИЗ
	|	Документ.ПодтверждениеНулевойСтавкиНДС.Состав КАК ПодтверждениеНулевойСтавкиНДССостав
	|ГДЕ
	|	ПодтверждениеНулевойСтавкиНДССостав.Ссылка = &СсылкаНаДокументОснование
	|	И ПодтверждениеНулевойСтавкиНДССостав.СчетФактураВыданный = &СсылкаНаСчетФактуру";
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Результат.ДокументОтгрузки
	Иначе
		Возврат Неопределено
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли
